goal-app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "updated_username"], ["password_digest", "$2a$10$.D1WRJgvitRP7Xubzz6Pzu13saCHgbKGuuP4pJDjgMDbnly6pQ9LK"], ["updated_at", "2018-11-16 22:13:47.660476"], ["id", 219]]
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 267], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 267]]
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy!